# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

print('Введите номер дня недели "от 1 до 7"')
a = int(input())


if a in range  or m==n*n:
 print('да')
else:
 print('нет')